## Price Prediction By Joshua Zireva

##### Import Libraries

In [115]:
import pandas as pd
import numpy as np
from sklearn import linear_model
import math

##### Read data from csv file

In [116]:
df = pd.read_csv("Houses.csv")
df

   Area  Bedrooms  Age   Price
0   350       3.0   10  306500
1   400       3.0   25  320000
2   250       4.0   16  240000
3   305       4.0   10  300000
4   320       3.0    5  350000
5   280       NaN   15  300000
6   400       4.0   25  380000
7   300       5.0   40  350000

##### Data Cleaning

In [117]:
# Finding median in order to replace on null value
median_bedroom = math.floor(df.Bedrooms.median())
median_bedroom

4

In [118]:
# Replacing null values with median and take a glimpse
df.Bedrooms = df.Bedrooms.fillna(median_bedroom)
df

   Area  Bedrooms  Age   Price
0   350       3.0   10  306500
1   400       3.0   25  320000
2   250       4.0   16  240000
3   305       4.0   10  300000
4   320       3.0    5  350000
5   280       4.0   15  300000
6   400       4.0   25  380000
7   300       5.0   40  350000

In [119]:
# Some descriptives
df.describe()

             Area  Bedrooms        Age          Price
count    8.000000  8.000000   8.000000       8.000000
mean   325.625000  3.750000  18.250000  318312.500000
std     54.211062  0.707107  11.285262   42694.042324
min    250.000000  3.000000   5.000000  240000.000000
25%    295.000000  3.000000  10.000000  300000.000000
50%    312.500000  4.000000  15.500000  313250.000000
75%    362.500000  4.000000  25.000000  350000.000000
max    400.000000  5.000000  40.000000  380000.000000

##### Model training and making some predictions

reg = linear_model.LinearRegression()
reg.fit(df[['Area','Bedrooms','Age']],df.Price)

In [120]:
reg.coef_

array([  791.84335568, 40889.24088835, -1067.28615404])

In [135]:
reg.intercept_

-73388.17371243134

In [160]:
reg.predict([[310,3,15]])

C:\Users\joshz\anaconda3\Lib\site-packages\sklearn\base.py:493: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([278741.69690192])